tests/http/performance/results/hey-http-apigw-result.txt

Summary:
  Total:	30.0118 secs
  Slowest:	0.3406 secs
  Fastest:	0.0015 secs
  Average:	0.0184 secs
  Requests/sec:	5423.0323
  
  Total data:	2604080 bytes
  Size/request:	16 bytes

Response time histogram:
  0.001 [1]	|
  0.035 [162451]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.069 [158]	|
  0.103 [42]	|
  0.137 [20]	|
  0.171 [34]	|
  0.205 [21]	|
  0.239 [11]	|
  0.273 [6]	|
  0.307 [3]	|
  0.341 [8]	|


Latency distribution:
  10% in 0.0159 secs
  25% in 0.0169 secs
  50% in 0.0181 secs
  75% in 0.0194 secs
  90% in 0.0209 secs
  95% in 0.0219 secs
  99% in 0.0257 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0015 secs, 0.3406 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0114 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0072 secs
  resp wait:	0.0184 secs, 0.0013 secs, 0.3277 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0053 secs

Status code distribution:
  [200]	162755 responses