tests/http/performance/results/hey-http-apigw-result.txt

Summary:
  Total:	30.3434 secs
  Slowest:	0.6094 secs
  Fastest:	0.0008 secs
  Average:	0.1644 secs
  Requests/sec:	607.1506
  
  Total data:	294768 bytes
  Size/request:	16 bytes

Response time histogram:
  0.001 [1]	|
  0.062 [133]	|■
  0.123 [7206]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.183 [4971]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.244 [2878]	|■■■■■■■■■■■■■■■■
  0.305 [2692]	|■■■■■■■■■■■■■■■
  0.366 [372]	|■■
  0.427 [105]	|■
  0.488 [29]	|
  0.549 [32]	|
  0.609 [4]	|


Latency distribution:
  10% in 0.0899 secs
  25% in 0.0933 secs
  50% in 0.1783 secs
  75% in 0.1862 secs
  90% in 0.2712 secs
  95% in 0.2765 secs
  99% in 0.3655 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0008 secs, 0.6094 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0075 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0013 secs
  resp wait:	0.1643 secs, 0.0008 secs, 0.6014 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0018 secs

Status code distribution:
  [200]	18423 responses