tests/http/performance/results/hey-http-apigw-result.txt

Summary:
  Total:	30.1305 secs
  Slowest:	0.6741 secs
  Fastest:	0.0007 secs
  Average:	0.1776 secs
  Requests/sec:	561.5577
  
  Total data:	270720 bytes
  Size/request:	16 bytes

Response time histogram:
  0.001 [1]	|
  0.068 [144]	|■
  0.135 [4954]	|■■■■■■■■■■■■■■■■■■■■■
  0.203 [9462]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.270 [66]	|
  0.337 [1942]	|■■■■■■■■
  0.405 [313]	|■
  0.472 [8]	|
  0.539 [10]	|
  0.607 [6]	|
  0.674 [14]	|


Latency distribution:
  10% in 0.0955 secs
  25% in 0.1018 secs
  50% in 0.1909 secs
  75% in 0.1941 secs
  90% in 0.2833 secs
  95% in 0.2880 secs
  99% in 0.3804 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0007 secs, 0.6741 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0070 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0080 secs
  resp wait:	0.1774 secs, 0.0006 secs, 0.6467 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0031 secs

Status code distribution:
  [200]	16920 responses