tests/http/performance/results/hey-http-ingress-result.txt

Summary:
  Total:	30.0053 secs
  Slowest:	0.2198 secs
  Fastest:	0.0004 secs
  Average:	0.0039 secs
  Requests/sec:	25831.6211
  
  Total data:	113162556 bytes
  Size/request:	146 bytes

Response time histogram:
  0.000 [1]	|
  0.022 [773562]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.044 [1366]	|
  0.066 [74]	|
  0.088 [20]	|
  0.110 [15]	|
  0.132 [8]	|
  0.154 [10]	|
  0.176 [6]	|
  0.198 [14]	|
  0.220 [10]	|


Latency distribution:
  10% in 0.0013 secs
  25% in 0.0019 secs
  50% in 0.0030 secs
  75% in 0.0049 secs
  90% in 0.0075 secs
  95% in 0.0096 secs
  99% in 0.0150 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.2198 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0071 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0048 secs
  resp wait:	0.0038 secs, 0.0003 secs, 0.2113 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0065 secs

Status code distribution:
  [404]	775086 responses