tests/http/performance/results/hey-http-ingress-result.txt

Summary:
  Total:	30.0047 secs
  Slowest:	0.3257 secs
  Fastest:	0.0003 secs
  Average:	0.0041 secs
  Requests/sec:	24671.8548
  
  Total data:	108079712 bytes
  Size/request:	146 bytes

Response time histogram:
  0.000 [1]	|
  0.033 [740014]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.065 [155]	|
  0.098 [2]	|
  0.131 [24]	|
  0.163 [11]	|
  0.196 [14]	|
  0.228 [10]	|
  0.261 [11]	|
  0.293 [19]	|
  0.326 [11]	|


Latency distribution:
  10% in 0.0013 secs
  25% in 0.0020 secs
  50% in 0.0032 secs
  75% in 0.0051 secs
  90% in 0.0078 secs
  95% in 0.0099 secs
  99% in 0.0149 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.3257 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0104 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0047 secs
  resp wait:	0.0040 secs, 0.0003 secs, 0.3142 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0102 secs

Status code distribution:
  [404]	740272 responses